{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2026-04-13T12:16:03.550734Z",
     "start_time": "2026-04-13T12:16:02.937118Z"
    }
   },
   "source": [
    "from neo4j import GraphDatabase\n",
    "import dotenv\n",
    "import os\n",
    "\n",
    "dotenv.load_dotenv()\n",
    "\n",
    "URI = \"neo4j://localhost:7687\"\n",
    "AUTH = (\"neo4j\", os.getenv(\"NEO4J_PASSWORD\"))"
   ],
   "outputs": [],
   "execution_count": 1
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-13T12:02:21.761878Z",
     "start_time": "2026-04-13T12:02:21.759745Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "#     print(\"Connected to Neo4j\")\n",
    "#     summary = driver.execute_query(\n",
    "#         \"\"\"\n",
    "#         CREATE (a:Person {name: $name})\n",
    "#         CREATE (b:Person {name: $friendName})\n",
    "#         CREATE (a)-[:KNOWS]->(b)\n",
    "#         \"\"\",\n",
    "#         name=\"Alice\", friendName=\"David\",\n",
    "#     ).summary\n",
    "#     print(\"Created {nodes_created} nodes in {time} ms.\".format(\n",
    "#         nodes_created=summary.counters.nodes_created,\n",
    "#         time=summary.result_available_after\n",
    "#     ))"
   ],
   "id": "c1631812a9f4c81e",
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-13T12:02:21.805176Z",
     "start_time": "2026-04-13T12:02:21.761878Z"
    }
   },
   "cell_type": "code",
   "source": [
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    print(\"Connected to Neo4j\")\n",
    "    records, summary, keys = driver.execute_query(\n",
    "        \"\"\"\n",
    "        MATCH (p:Person{name: $name})-[r:DIRECTED]->(m:Movie)\n",
    "        WHERE m.year > $year\n",
    "        RETURN p.name AS director, m.year AS year, m.title AS movie\n",
    "        \"\"\",\n",
    "        # name=\"张艺谋\", year=1990,\n",
    "        parameters_={\"name\": \"张艺谋\", \"year\": 1990},\n",
    "    )\n",
    "    print(f\"查询的结果为：{len(records)}, 运行时间：{summary.result_available_after}ms\")\n",
    "    for record in records:\n",
    "        print(record.data())"
   ],
   "id": "c8aab59085d1ebff",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to Neo4j\n",
      "查询的结果为：3, 运行时间：1ms\n",
      "{'director': '张艺谋', 'year': 2023, 'movie': '满江红'}\n",
      "{'director': '张艺谋', 'year': 2002, 'movie': '英雄'}\n",
      "{'director': '张艺谋', 'year': 1994, 'movie': '活着'}\n"
     ]
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-13T12:02:21.809305Z",
     "start_time": "2026-04-13T12:02:21.806295Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for record in records:\n",
    "    print(f\"{record['director']}在 {record['year']}年 导演了 {record['movie']}\")"
   ],
   "id": "cdac2652e68c3c64",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "张艺谋在 2023年 导演了 满江红\n",
      "张艺谋在 2002年 导演了 英雄\n",
      "张艺谋在 1994年 导演了 活着\n"
     ]
    }
   ],
   "execution_count": 4
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
