{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2026-04-16T05:55:51.549202Z",
     "start_time": "2026-04-16T05:55:47.267312Z"
    }
   },
   "source": [
    "from langchain_neo4j import Neo4jGraph\n",
    "from configuration.config import *\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url=NEO4J_CONFIG[\"uri\"],\n",
    "    username=NEO4J_CONFIG[\"auth\"][0],\n",
    "    password=NEO4J_CONFIG[\"auth\"][1],\n",
    ")"
   ],
   "outputs": [],
   "execution_count": 1
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-16T05:55:51.560148Z",
     "start_time": "2026-04-16T05:55:51.550535Z"
    }
   },
   "cell_type": "code",
   "source": "print(graph.schema)",
   "id": "faea9c3524ab3ac1",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Category1 {name: STRING, id: INTEGER}\n",
      "Category2 {name: STRING, id: INTEGER}\n",
      "Category3 {name: STRING, id: INTEGER}\n",
      "BaseAttrName {name: STRING, id: INTEGER}\n",
      "BaseAttrValue {name: STRING, id: INTEGER}\n",
      "SPU {name: STRING, id: INTEGER}\n",
      "SKU {name: STRING, id: INTEGER}\n",
      "Trademark {name: STRING, id: INTEGER}\n",
      "SaleAttrName {name: STRING, id: INTEGER}\n",
      "SaleAttrValue {name: STRING, id: INTEGER}\n",
      "Tag {name: STRING, id: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Category1)-[:Have]->(:BaseAttrName)\n",
      "(:Category2)-[:Belong]->(:Category1)\n",
      "(:Category2)-[:Have]->(:BaseAttrName)\n",
      "(:Category3)-[:Have]->(:BaseAttrName)\n",
      "(:Category3)-[:Belong]->(:Category2)\n",
      "(:BaseAttrName)-[:Have]->(:BaseAttrValue)\n",
      "(:SPU)-[:Have]->(:Tag)\n",
      "(:SPU)-[:Have]->(:SaleAttrName)\n",
      "(:SPU)-[:Belong]->(:Trademark)\n",
      "(:SPU)-[:Belong]->(:Category3)\n",
      "(:SKU)-[:Have]->(:BaseAttrValue)\n",
      "(:SKU)-[:Have]->(:SaleAttrValue)\n",
      "(:SKU)-[:Belong]->(:SPU)\n",
      "(:SaleAttrName)-[:Have]->(:SaleAttrValue)\n"
     ]
    }
   ],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-16T05:55:51.580750Z",
     "start_time": "2026-04-16T05:55:51.561217Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# 查询\n",
    "cypher = \"MATCH (n) RETURN n LIMIT 5\"\n",
    "graph.query(cypher)"
   ],
   "id": "972ac5b2cde8c6bb",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': {'name': '图书、音像、电子书刊', 'id': 1}},\n",
       " {'n': {'name': '手机', 'id': 2}},\n",
       " {'n': {'name': '家用电器', 'id': 3}},\n",
       " {'n': {'name': '数码', 'id': 4}},\n",
       " {'n': {'name': '家居家装', 'id': 5}}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-16T05:55:53.096337Z",
     "start_time": "2026-04-16T05:55:51.581764Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from langchain_deepseek import ChatDeepSeek\n",
    "\n",
    "# 定义大模型\n",
    "llm = ChatDeepSeek(model='deepseek-chat', temperature=0, api_key=API_KEY)"
   ],
   "id": "87927b79a9b6d441",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-16T05:55:53.103612Z",
     "start_time": "2026-04-16T05:55:53.099470Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from langchain_neo4j import GraphCypherQAChain\n",
    "\n",
    "# 定义chain\n",
    "chain = GraphCypherQAChain.from_llm(graph=graph, llm=llm, verbose=True, allow_dangerous_requests=True)"
   ],
   "id": "be73f9cc8f846211",
   "outputs": [],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-16T05:55:57.595500Z",
     "start_time": "2026-04-16T05:55:53.103612Z"
    }
   },
   "cell_type": "code",
   "source": "result = chain.invoke({\"query\": \"苹果有哪些产品？\"})",
   "id": "26ab86e8d5aaba09",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001B[1m> Entering new GraphCypherQAChain chain...\u001B[0m\n",
      "Generated Cypher:\n",
      "\u001B[32;1m\u001B[1;3mMATCH (t:Trademark {name: '苹果'})<-[:Belong]-(spu:SPU)\n",
      "RETURN spu.name AS product_name, spu.id AS product_id\u001B[0m\n",
      "Full Context:\n",
      "\u001B[32;1m\u001B[1;3m[{'product_name': 'Apple iPhone 12', 'product_id': 3}, {'product_name': 'Apple iPhone 16 Pro', 'product_id': 19}]\u001B[0m\n",
      "\n",
      "\u001B[1m> Finished chain.\u001B[0m\n"
     ]
    }
   ],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-16T05:56:02.221431Z",
     "start_time": "2026-04-16T05:55:57.595500Z"
    }
   },
   "cell_type": "code",
   "source": "result = chain.invoke({\"query\": \"Apple有哪些产品？\"})",
   "id": "84ba1fbc9a2ccda2",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001B[1m> Entering new GraphCypherQAChain chain...\u001B[0m\n",
      "Generated Cypher:\n",
      "\u001B[32;1m\u001B[1;3mcypher\n",
      "MATCH (t:Trademark {name: 'Apple'})<-[:Belong]-(spu:SPU)\n",
      "RETURN spu.name AS product_name, spu.id AS product_id\n",
      "\u001B[0m\n",
      "Full Context:\n",
      "\u001B[32;1m\u001B[1;3m[]\u001B[0m\n",
      "\n",
      "\u001B[1m> Finished chain.\u001B[0m\n"
     ]
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "9ce681af683024"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
